#### Part 5: Corey Schafer Pandas Extensive

In [1]:
import pandas as pd

In [2]:
# recap

In [3]:
people = {
    'fname' : ['Suminder', 'Deepinder', 'Nimrat'],
    'lname' : ['Singh', 'Kaur', 'Kaur'],
    'email' : ['suminder.singh@ex.com', 'dkaur@ex.com', 'nkaur@ex.com']
}

df_ppl = pd.DataFrame(people)

In [4]:
df_ppl

       fname  lname                  email
0   Suminder  Singh  suminder.singh@ex.com
1  Deepinder   Kaur           dkaur@ex.com
2     Nimrat   Kaur           nkaur@ex.com

In [5]:
df_ppl.columns = [x.capitalize() for x in df_ppl.columns]

In [6]:
df_ppl

       Fname  Lname                  Email
0   Suminder  Singh  suminder.singh@ex.com
1  Deepinder   Kaur           dkaur@ex.com
2     Nimrat   Kaur           nkaur@ex.com

In [7]:
df_ppl['1'] = [x.split('@')[0] for x in df_ppl.loc[:,'Email']]

In [15]:
df_ppl

,Fname,Lname,Email,"(1, 2)",1
0,Suminder,Singh,suminder.singh@ex.com,"[suminder.singh, ex.com]",suminder.singh
1,Deepinder,Kaur,dkaur@ex.com,"[dkaur, ex.com]",dkaur
2,Nimrat,Kaur,nkaur@ex.com,"[nkaur, ex.com]",nkaur

In [10]:
df_ppl

       Fname  Lname                  Email               1
0   Suminder  Singh  suminder.singh@ex.com  suminder.singh
1  Deepinder   Kaur           dkaur@ex.com           dkaur
2     Nimrat   Kaur           nkaur@ex.com           nkaur

In [11]:
df_ppl.drop(columns = '1', inplace=True)

In [12]:
df_ppl

       Fname  Lname                  Email
0   Suminder  Singh  suminder.singh@ex.com
1  Deepinder   Kaur           dkaur@ex.com
2     Nimrat   Kaur           nkaur@ex.com

In [14]:
df_ppl.append({'Fname': 'tst', 'Lname': 'tst1'}, ignore_index=True, sort=False)

       Fname  Lname                  Email
0   Suminder  Singh  suminder.singh@ex.com
1  Deepinder   Kaur           dkaur@ex.com
2     Nimrat   Kaur           nkaur@ex.com
3        tst   tst1                    NaN

In [15]:
new = {
    'Fname' : ['Ankit', 'Reena', 'Vicky'],
    'Lname' : ['Chopra', 'Sidhu', 'Bedi']
}

df2 = pd.DataFrame(new)

In [16]:
df2

   Fname   Lname
0  Ankit  Chopra
1  Reena   Sidhu
2  Vicky    Bedi

In [23]:
df_ppl = df_ppl.append(df2).reset_index().set_index('index')

In [24]:
df_ppl

       level_0      Fname   Lname                  Email
index
0.0          0   Suminder   Singh  suminder.singh@ex.com
1.0          1  Deepinder    Kaur           dkaur@ex.com
2.0          2     Nimrat    Kaur           nkaur@ex.com
0.0          3      Ankit  Chopra                    NaN
1.0          4      Reena   Sidhu                    NaN
2.0          5      Vicky    Bedi                    NaN
0.0          6      Ankit  Chopra                    NaN
1.0          7      Reena   Sidhu                    NaN
2.0          8      Vicky    Bedi                    NaN
NaN          0      Ankit  Chopra                    NaN
NaN          1      Reena   Sidhu                    NaN
NaN          2      Vicky    Bedi                    NaN

In [26]:
df_ppl.drop(columns='level_0', inplace=True)

In [36]:
people = {
    'fname' : ['Suminder', 'Deepinder', 'Nimrat'],
    'lname' : ['Singh', 'Kaur', 'Kaur'],
    'email' : ['suminder.singh@ex.com', 'dkaur@ex.com', 'nkaur@ex.com']
}

new = {
    'Fname' : ['Ankit', 'Reena', 'Vicky'],
    'Lname' : ['Chopra', 'Sidhu', 'Bedi']
}

df1 = pd.DataFrame(people)
df2 = pd.DataFrame(new)

In [38]:
df1

       fname  lname                  email
0   Suminder  Singh  suminder.singh@ex.com
1  Deepinder   Kaur           dkaur@ex.com
2     Nimrat   Kaur           nkaur@ex.com

In [39]:
df2

   Fname   Lname
0  Ankit  Chopra
1  Reena   Sidhu
2  Vicky    Bedi

In [42]:
df1.columns = [x.capitalize() for x in df1.columns]

In [43]:
df1

       Fname  Lname                  Email
0   Suminder  Singh  suminder.singh@ex.com
1  Deepinder   Kaur           dkaur@ex.com
2     Nimrat   Kaur           nkaur@ex.com

In [45]:
df1.rename(columns = {'Email': 'Email_Add'}, inplace=True)

In [46]:
df1

       Fname  Lname              Email_Add
0   Suminder  Singh  suminder.singh@ex.com
1  Deepinder   Kaur           dkaur@ex.com
2     Nimrat   Kaur           nkaur@ex.com

In [47]:
df1.loc[2]

Fname              Nimrat
Lname                Kaur
Email_Add    nkaur@ex.com
Name: 2, dtype: object

In [48]:
filt = df1['Email_Add'] == 'suminder.singh@ex.com'
df1.loc[filt, ['Fname', 'Lname']] = ['Sumi', 'Sammy']

In [49]:
df1

       Fname  Lname              Email_Add
0       Sumi  Sammy  suminder.singh@ex.com
1  Deepinder   Kaur           dkaur@ex.com
2     Nimrat   Kaur           nkaur@ex.com